music_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_param)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "from_browser@gmail.com"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2022-11-16 00:47:33.928984"], ["updated_at", "2022-11-16 00:47:33.928984"]]